of222/tutorials/rheoEFoam/selecMembrane/NernstPlanck/solution1D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    cyc0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          90;
        startFace       89;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyc1;
    }
    reservoir
    {
        type            wall;
        nFaces          1;
        startFace       179;
    }
    membrane
    {
        type            wall;
        nFaces          1;
        startFace       180;
    }
    cyc1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          90;
        startFace       181;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  cyc0;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          180;
        startFace       271;
    }
)

// ************************************************************************* //
